Repository: Behat/Behat
Catalog: i18n/*.xliff
Languages: cs, es, nl, pl, pt_pt

# proposal-title
source: You can implement step definitions for undefined steps with these snippets:
cs: Můžete implementovat definice kroku pro nedifinované kroky za použití těchto kusů kódu (snippetů):
es: Puedes implementar la definición de pasos de los pasos sin definir con el siguiente código:
nl: U kunt stap definities voor ongedefinieerde stappen implementeren met deze snippets:
pl: Możesz zaimplementować niezdefiniowane jeszcze kroki, korzystając z tych fragmentów kodu:
pt_pt: Você pode implementar definições de passos para aqueles ainda não definidos utilizando-se destes trechos:

# failed-steps-title
source: failed steps
cs: zkažené kroky
es: Pasos fallidos
nl: mislukte stappen
pl: nieudane kroki
pt_pt: passos que falharam

# pending-steps-title
source: pending steps
cs: čekající kroky
es: Pasos pendientes
nl: wachtende stappen
pl: oczekujące kroki
pt_pt: passos pendentes

# scenarios-count
source: {0} No scenarios|{1} 1 scenario|]1,Inf] %1% scenarios
cs: {0} Žádný scénář|{1} 1 scénář|]|{2,3,4} %1% scénáře|4,Inf] %1% scénářů
es: {0} No hay escenarios|{1} 1 escenario|]1,Inf] %1% escenarios
nl: {0} Geen scenario's|{1} 1 scenario|]1,Inf] %1% scenario's
pl: {0} Brak scenariuszy|{1} 1 scenariusz|{2,3,4,22,23,24,32,33,34,42,43,44} %1% scenariusze|]4,Inf] %1% scenariuszy
pt_pt: {0} Nenhum cenário|{1} 1 cenário|]1,Inf] %1% cenários

# steps-count
source: {0} No steps|{1} 1 step|]1,Inf] %1% steps
cs: {0} Žádné kroky|{1} 1 krok|{2,3,4} %1% kroky|]4,Inf] %1% kroků
es: {0} No hay pasos|{1} 1 paso|]1,Inf] %1% pasos
nl: {0} Geen stappen|{1} 1 stap|]1,Inf] %1% stappen
pl: {0} Brak kroków|{1} 1 krok|{2,3,4,22,23,24,32,33,34,42,43,44} %1% kroki|]4,Inf] %1% kroków
pt_pt: {0} Nenhum passo|{1} 1 passo|]1,Inf] %1% passos

# passed-count
source: [1,Inf] %1% passed
cs: {1} %1% prošel|{2,3,4} %1% prošli|[4,Inf] %1% prošlo
es: [1,Inf] %1% exitosos
nl: [1,Inf] %1% gelukt
pl: {1} %1% udany|{2,3,4,22,23,24,32,33,34,42,43,44} %1% udane|]4,Inf] %1% udanych
pt_pt: {1} passou|]1,Inf] %1% passaram

# failed-count
source: [1,Inf] %1% failed
cs: {1} %1% selhal|{2,3,4} %1% selhali|[4,Inf] %1% selhalo
es: [1,Inf] %1% fallidos
nl: [1,Inf] %1% mislukt
pl: {1} %1% nieudany|{2,3,4,22,23,24,32,33,34,42,43,44} %1% nieudane|]4,Inf] %1% nieudanych
pt_pt: {1} falhou|]1,Inf] %1% falharam

# pending-count
source: [1,Inf] %1% pending
cs: {1} %1% čeká|{2,3,4} %1% čekají|[4,Inf] %1% čeká
es: [1,Inf] %1% pendientes
nl: [1,Inf] %1% wachtend
pl: {1} %1% oczekujący|{2,3,4,22,23,24,32,33,34,42,43,44} %1% oczekujące|]4,Inf] %1% oczekujących
pt_pt: {1} pendente|]1,Inf] %1% pendentes

# undefined-count
source: [1,Inf] %1% undefined
cs: {1} %1% nedefinován|{2,3,4} %1% nedefinovány|[4,Inf] %1% nedefinováno
es: [1,Inf] %1% sin definir
nl: [1,Inf] %1% ongedefinieerd
pl: {1} %1% niezdefiniowany|{2,3,4,22,23,24,32,33,34,42,43,44} %1% niezdefiniowane|]4,Inf] %1% niezdefiniowanych
pt_pt: {1} indefinido|]1,Inf] %1% indefinidos

# skipped-count
source: [1,Inf] %1% skipped
cs: {1} %1% přeskočen| {2,3,4} %1% přeskočeny|[5,Inf] %1% přeskočeno
es: [1,Inf] %1% omitidos
nl: [1,Inf] %1% overgeslagen
pl: {1} %1% pominięty|{2,3,4,22,23,24,32,33,34,42,43,44} %1% pominięte|]4,Inf] %1% pominiętych
pt_pt: {1} ignorado|]1,Inf] %1% ignorados
